---
kind: property
id: P:Autodesk.Revit.DB.Lighting.CircleLightShape.EmitDiameter
source: html/3955f5fc-e13b-9a0d-05eb-6b3e54a42ed5.htm
---
# Autodesk.Revit.DB.Lighting.CircleLightShape.EmitDiameter Property

The emit diameter.

## Syntax (C#)
```csharp
public double EmitDiameter { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.